Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: Once a referent has been blessed, the C<blessed> function from the L<Scalar::Util> core module can tell us its class name.
es: Una vez que un referente ha sido bendecido, la función C<blessed> del módulo L<Scalar::Util> indicará el nombre de la clase asociada.

source: Once again, C<module-starter> or C<h2xs> has done all the work for you.
es: Una vez más, C<module-starter> (o C<h2xs>) se encarga de todo.

source: Once it is reached, matching continues in B, which may also backtrack as necessary; however, should B not match, then no further backtracking will take place, and the pattern will fail outright at the current starting position.
es: Cuando se llega a dicho verbo, la coincidencia continúa en B, que también puede hacer una vuelta atrás cuando sea necesario; sin embargo, si no hubiera coincidencia con B, entonces ya no se llevará a cabo la vuelta atrás, y el patrón no coincidirá en la actual posición de inicio.

source: Once registered, your module will appear in the by-module and by-category listings on CPAN.
es: Una vez registrado, el módulo figurará en las listas I<by-module> y I<by-category> de CPAN.

source: Once the pipe is set up, the two processes in question can read and write as if they were talking to a normal file, with some caveats.
es: Una vez establecida la conexión, los dos procesos en cuestión pueden leer y escribir como si se comunicaran con un archivo normal, aunque con algunas limitaciones.

source: Once the 'aaab' at the start of the string has matched, and the C<(*SKIP)> executed, the next starting point will be where the cursor was when the C<(*SKIP)> was executed.
es: Una vez que se detecta 'aaab' al principio de la cadena y se ejecuta el patrón C<(*SKIP)>, el siguiente punto de partida será el lugar donde estaba el cursor cuando se ejecutó C<(*SKIP)>.

source: Once uploaded, it'll sit unnoticed in your author directory.
es: Una vez subido, el módulo se alojará en su directorio de autor sin hacer ruido.

source: Once upon a time, C code compilable under both BSD and SysV.
es: En su día, se llamaba así al código C compilable en BSD y SysV.

source: Once we've blessed the hash referred to by C<$self> we can start calling methods on it.
es: Una vez bendecido el hash al que hace referencia C<$self>, puede empezar a utilizarse para hacer llamadas a métodos.

source: Once you have an open filehandle, you can call methods on it.
es: Una vez abierto un identificador de archivo, puede usarlo para llamar a métodos.

source: Once you have changed into the repository directory, you can inspect it.
es: Puede entrar en el directorio del repositorio para inspeccionarlo.

source: Once you have write access, you will need to modify the URL for the origin remote to enable pushing.
es: Cuando tenga acceso de escritura, tendrá que modificar la dirección URL del repositorio remoto de origen para el que desea habilitar la capacidad de enviar cambios.

source: Once you start accumulating users, they'll send you bug reports.
es: Cuando empiece a acumular usuarios, también empezará a recibir informes de error.

source: Once you're done here, check out L<perlhacktips> next.
es: Por último, consulte L<perlhacktips>.

source: Once you've ensured that your module passes its own tests - always a good thing to make sure - you can C<make dist>, and the Makefile will hopefully produce you a nice tarball of your module, ready for upload.
es: Cuando se haya asegurado de que el módulo supera todas las pruebas (algo que siempre es recomendable), puede ejecutar C<make dist> para que Makefile produzca un paquete tar del módulo, listo para enviarlo a CPAN.

source: Once you've finished writing your commit message and exited your editor, git will write your change to disk and tell you something like this:
es: Cuando haya terminado de escribir su mensaje de confirmación y salga del editor, git escribirá el cambio en el disco y mostrará un mensaje similar al siguiente:

source: One bit.
es: Un bit.

source: One is C<perl5.git.perl.org> itself (I<camel>), which is the 'master' repository.
es: Uno es C<perl5.git.perl.org> (I<camel>), el repositorio "principal".

source: One more rule is needed to understand how a match is determined for the whole regular expression: a match at an earlier position is always better than a match at a later position.
es: Otra regla que es necesaria para entender cómo se determina una coincidencia para la expresión regular completa: una coincidencia en una posición anterior es siempre mejor que una coincidencia en una posición posterior.

source: One name for a file.
es: Identificador que se asigna a un archivo.

source: One of the guiding mottos for Perl development is "there's more than one way to do it" (TMTOWTDI, sometimes pronounced "tim toady").
es: Uno de los lemas que guían el desarrollo de Perl es "se puede hacer de varias maneras", que es la traducción de "there's more than one way to do it" (o TMTOWTDI, que en inglés se pronuncia como "tim toady").

source: One of Perl's internal formats happens to be UTF-8.
es: Resulta que uno de los formatos internos de Perl es UTF-8.

source: One of the things that makes Perl really powerful is the fact that Perl hackers tend to want to share the solutions to problems they've faced, so you and I don't have to battle with the same problem again.
es: Uno de los factores que hacen que Perl sea una herramienta realmente eficaz es el hecho de que los hackers que usan este lenguaje suelen compartir el código que desarrollan al solucionar problemas para que sus camaradas no tengan que enfrentarse a esos mismos problemas.

source: One or more embedded pattern-match modifiers, to be turned on (or turned off, if preceded by C<->) for the remainder of the pattern or the remainder of the enclosing pattern group (if any).
es: Uno o más modificadores de detección de coincidencias de patrón incrustados, que han de ser activados (o desactivados, si van precedidos de C<->) para el resto del patrón o el resto del grupo de patrones que lo contiene (si existe).

source: One should note that these code blocks don't really exist as named subroutines (despite their appearance).
es: Debe tenerse en cuenta que estos bloques de código no existen realmente como subrutinas con nombres, aunque así lo parezca.

source: One simple way to check that things are in the right place is to print out the hard-coded C<@INC> that perl looks through for libraries:
es: Una manera sencilla de comprobar que todo está en su sitio es imprimir en pantalla la variable C<@INC> incrustada en el programa, en la que perl busca las bibliotecas:

source: One thing Perl porters should note is that F<perl> doesn't tend to use that much of the C standard library internally; you'll see very little use of, for example, the F<ctype.h> functions in there.
es: Los miembros del equipo de desarrollo principal (I<Perl porters>) deben tener en cuenta que en F<perl> no se usa mucho la biblioteca estándar de C internamente; por ejemplo, F<ctype.h> se usa muy poco.

source: One useful value for C<PERLDOC_PAGER> is C<less -+C -E>.
es: Un valor útil para C<PERLDOC_PAGER> es C<less -+C -E>.

source: One way to describe which substring is actually matched is the concept of backtracking (see L<"Backtracking">).
es: Una forma de describir qué subcadena coincidente realmente, es usar el concepto de la vuelta atrás (vea L<"Vuelta atrás">).

source: One-line BLOCK may be put on one line, including curlies.
es: Un BLOQUE de una línea puede colocarse en una sola línea, llaves incluidas.

source: Only identifiers starting with letters (or underscore) are stored in a package's symbol table.
es: En la tabla de símbolos de un paquete sólo se almacenarán los identificadores que comiencen por letras (o guiones bajos).

source: Only the best match for C<S> is considered.
es: Solo se considera la mejor coincidencia para C<S>.

source: Only the digits 0 through 7 are allowed.
es: Solo se admiten los dígitos 0 a 7.

source: Oops, we forgot one thing: what if there are spaces at the start of the pattern?
es: Vaya, nos olvidamos de una cosa: ¿qué pasa si hay espacios al principio del patrón?

source: Opening curly on same line as keyword, if possible, otherwise line up.
es: Llave de apertura en la misma línea que la palabra reservada, si es posible; si no, alineada en vertical con ella.

source: Operator overloading allows user-defined behaviors for numbers, such as operations over arbitrarily large integers, floating points numbers with arbitrary precision, operations over "exotic" numbers such as modular arithmetic or p-adic arithmetic, and so on.
es: que permite establecer comportamientos definidos por el usuario para números, como operaciones con enteros arbitrariamente grandes, números de punto flotante de precisión arbitraria, operaciones con números "exóticos" (como la aritmética modular o la aritmética de números p-ádicos), etc.

source: Operators like C<+> are left associative, while operators like C<**> are right associative.
es: Los operadores como C<+> son asociativos por la izquierda, mientras que operadores como C<**> son asociativos por la derecha.

source: Operators such as C<**>, C<sin> and C<exp> force arguments to floating point format.
es: Algunos operadores, como C<**>, C<sin> y C<exp>, fuerzan la conversión de los argumentos al formato de punto flotante.

source: Or at least that pretend to.
es: O que al menos tratarán de hacerlo.

source: Or if you already have an open filehandle:
es: O bien, si ya tiene un identificador de archivo abierto:

source: Or if you try to do
es: O si intenta esto

source: Or it can do a little of both.
es: También se pueden combinar ambos mecanismos.

source: Or maybe perl5-porters:
es: O incluso la de perl5-porters:

source: Or the C</a> modifier can be used to force C<\d> to match just the ASCII 0 through 9.
es: O bien, puede usar el modificador C</a> para forzar que C<\d> solo detecte los caracteres ASCII 0 a 9.

source: Or you could just merge the whole branch if you like it all:
es: O puede simplemente combinar la rama completa si lo desea:

source: Or, if you're fond of VMS command syntax:
es: O bien, si es aficionado a la sintaxis de comandos VMS:

source: Or, if you're lazy, just:
es: Si no le sobra energía, puede limitarse a escribir esto:

source: Or, you can combine this step with the next to save disk space:
es: O bien, puede combinar este paso con el siguiente para ahorrar espacio en disco:

source: Ordering of two matches for C<S> is the same as for C<S>.
es: El orden de dos coincidencias para C<S> es el mismo que para C<S>.

# Ordinary code runs at runtime. ";
source: Ordinary code runs at runtime.\n";
es: El código normal se ejecuta en tiempo de ejecución.\n";

source: Originally from the old Unix editor command for "Globally search for a Regular Expression and Print it", now used in the general sense of any kind of search, especially text searches.
es: Originalmente, el antiguo comando de editor Unix "Globally search for a Regular Expression and Print it" (hacer una búsqueda global de una expresión regular e imprimir el resultado). En la actualidad se usa en el sentido general de cualquier tipo de búsqueda, especialmente las búsquedas de texto.

source: Originally, a script was a canned sequence of normally interactive commands--that is, a chat script.
es: Originalmente, un script era una secuencia cerrada de comandos normalmente interactivos (es decir, un script de chat).

source: Other committers should check with a topic branch's creator before making any change to it.
es: Si desea contribuir cambios a una rama puntual de otra persona, antes deberá consultárselo al autor de la rama.

source: Other modules should begin with a capital letter and use mixed case, but probably without underscores due to limitations in primitive file systems' representations of module names as files that must fit into a few sparse bytes.
es: Los nombres de los demás módulos deben empezar por una letra mayúscula y usar luego una mezcla de mayúsculas y minúsculas, pero preferiblemente sin guiones bajos (por limitaciones en sistemas de archivos primitivos para la representación de nombres de módulos como archivos que deben ajustarse a unos pocos bytes dispersos).

source: Other people picked up on this and started to write clever or obfuscated programs to produce the same output, spinning things quickly out of control while still providing hours of amusement for their creators and readers.
es: Otras personas adoptaron esta tendencia y empezaron a escribir programas astutos o enrevesados para producir el mismo resultado, y se descontroló el asunto, lo que proporcionó grandes momentos de diversión a sus creadores y lectores.

source: Other places to ask questions are on the L<PerlMonks site|http://www.perlmonks.org/> or L<stackoverflow|http://stackoverflow.com/questions/tagged/perl>.
es: Otros lugares en los que puede hacer consultas son el L<sitio de PerlMonks|http://www.perlmonks.org/> y L<stackoverflow|http://stackoverflow.com/questions/tagged/perl>.

source: Other useful sources include the Free On-Line Dictionary of Computing L<http://foldoc.org/>, the Jargon File L<http://catb.org/~esr/jargon/>, and Wikipedia L<http://www.wikipedia.org/>.
es: Otras fuentes útiles son: Free On-Line Dictionary of Computing L<http://foldoc.org/>, Jargon File L<http://catb.org/~esr/jargon/> y Wikipedia L<http://www.wikipedia.org/>.

source: Others are experimental and may change without warning or be completely removed.
es: Otras son experimentales y pueden cambiar sin previo aviso o ser retiradas.

source: Otherwise arguments are converted to floating point format and the floating point result is used.
es: De lo contrario, los argumentos se convierten al formato de punto flotante y se usa el resultado de punto flotante.

source: Otherwise if you really do want to build Perl, you need to get a binary version of C<gcc> for your system first.
es: Si prefiere compilar Perl, lo primero que debe hacer es obtener una versión binaria de C<gcc> para su sistema.

# Otherwise it matches any character but C< >.
source: Otherwise it matches any character but C<\n>.
es: En los demás casos coincide con cualquier carácter, excepto C<\n>.

source: Otherwise use a C<foreach()> loop or the C<system()> function instead.
es: Como alternativa, use un bucle C<foreach()> o la función C<system()>.

source: Otherwise, C</a> behaves like the C</u> modifier, in that case-insensitive matching uses Unicode semantics; for example, "k" will match the Unicode C<\N{KELVIN SIGN}> under C</i> matching, and code points in the Latin1 range, above ASCII will have Unicode rules when it comes to case-insensitive matching.
es: Por lo demás, C</a> se comporta como el modificador C</u>, puesto que la detección que no distingue mayúsculas de minúsculas utiliza semántica Unicode; por ejemplo, "k" coincidirá con el carácter Unicode C<\N{KELVIN SIGN}> si se usa C</i>, y los códigos de caracteres Latin1 no incluidos en ASCII seguirán reglas de Unicode para la detección de coincidencias sin distinguir mayúsculas de minúsculas.

source: Otherwise, C<L<use locale|perllocale>> sets the default modifier to C</l>; and C<L<use feature 'unicode_strings|feature>>, or C<L<use 5.012|perlfunc/use VERSION>> (or higher) set the default to C</u> when not in the same scope as either C<L<use locale|perllocale>> or C<L<use bytes|bytes>>.
es: De lo contrario, C<L<use locale|perllocale>> establece el modificador predeterminado en C</l>; y C<L<use feature 'unicode_strings|feature>> o C<L<use 5.012|perlfunc/use VERSION>> (o superior) establece el valor predeterminado en C</u> cuando no estén en el mismo ámbito tanto si está en efecto C<L<use locale|perllocale>> como C<L<use bytes|bytes>>.

source: Otherwise, you'll have to follow the steps below.
es: De lo contrario, tendrá que realizar los pasos siguientes.

source: Our constructor and accessors are not very smart.
es: Ni el constructor ni los métodos de acceso del ejemplo anterior son muy sólidos.

source: Our earlier example, C<$days{'Feb'}> can be written as C<$days{Feb}> and the quotes will be assumed automatically.
es: En un ejemplo anterior, C<$jornadas{'Feb'}> puede escribirse como C<$jornadas{Feb}> y las comillas se agregarán automáticamente.

source: Our new tests pass, hooray!
es: ¡Pruebas nuevas superadas! ¡Viva!

source: Outgoing, only rsync, ssh and git are allowed.
es: Hacia fuera, solo se admiten rsync, ssh y git.

source: Outside of a subroutine, __SUB__ is the undefined value.
es: Fuera de una subrutina, __SUB__ devuelve el valor indefinido.

source: Outside the pattern, the numbered variables (C, C, etc.) continue to refer to these same values, as long as the pattern was the last successful match of the current dynamic scope.
es: Fuera del patrón, las variables numeradas (C, C, etc.) hacen referencia a estos mismos valores, con tal de que el patrón fuera la última detección correcta en el ámbito dinámico actual.

source: Over the years, Perl has grown into a general-purpose programming language.
es: Con los años, Perl se ha convertido en un lenguaje de programación de propósito general.

source: Over the years, many people have developed systems which build on top of Perl's built-in system to provide more features and convenience.
es: A lo largo de los años, muchas personas han desarrollado sistemas basados en el sistema predefinido de Perl para proporcionar más características y facilidades.

source: PARNO is a sequence of digits (not starting with 0) whose value reflects the paren-number of the capture group to recurse to.
es: PARNO es una secuencia de dígitos (que no empieza en 0) cuyo valor refleja el número del par de paréntesis del grupo de captura al que se llega por recursividad.

source: POSIX 1003.1 compliant library
es: biblioteca compatible con POSIX 1003.1

source: Package names are sometimes an exception to this rule.
es: A veces los nombres de los módulos son una excepción a esta regla.

source: Package->VERSION(1.2);
es: Paquete->VERSION(1.2);

source: Packages may themselves contain package separators, as in C<$OUTER::INNER::var>.
es: Los paquetes también pueden contener separadores, como en C<$EXTERIOR::INTERIOR::var>.

source: PageName|ModuleName|ProgramName|URL
es: NombrePágina|NombreMódulo|NombrePrograma|DirecciónURL

source: Parent
es: Padre

source: Past contributors are: brian d foy C<< <bdfoy@cpan.org> >> Adriano R. Ferreira C<< <ferreira@cpan.org> >>, Sean M. Burke C<< <sburke@cpan.org> >>, Kenneth Albanowski C<< <kjahds@kjahds.com> >>, Andy Dougherty C<< <doughera@lafcol.lafayette.edu> >>, and many others.
es: Anteriormente contribuyeron a este documento: brian d foy C<< <bdfoy@cpan.org> >> Adriano R. Ferreira C<< <ferreira@cpan.org> >>, Sean M. Burke C<< <sburke@cpan.org> >>, Kenneth Albanowski C<< <kjahds@kjahds.com> >>, Andy Dougherty C<< <doughera@lafcol.lafayette.edu> >> y muchos otros.

source: Patch the originals instead.
es: Debe aplicar los parches a los archivos originales.

source: Patches that were formatted by C<git format-patch> are applied with C<git am>:
es: Los parches a los que se aplicó formato con C<git format-patch> se aplican mediante C<git am>:

source: PaternalGrandparent MaternalGrandparent \ / Father Mother \ / Child
es: AbueloPaterno AbueloMaterno \ / Padre Madre \ / Hijo

source: Perhaps you could move them?
es: ¿Se anima a moverlas?

source: Perl has two visibility mechanisms: it does L</dynamic scoping> of L<local|perlfunc/local> L<variables|/variable>, meaning that the rest of the L</block>, and any L<subroutines|/subroutine> that are called by the rest of the block, can see the variables that are local to the block.
es: Perl dispone de dos mecanismos de visibilidad: realiza un L</control de ámbito dinámico> de L<variables|/variable> L<locales|perlfunc/local>, lo que significa que el resto del L<bloque|/bloqueo-bloque> y las L<subrutinas|/subrutina> llamadas por el resto del bloque pueden ver las variables locales para ese bloque.

source: Perl implements these using L<references|/reference>--see L<perllol> and L<perldsc>.
es: Perl los implementa mediante L<referencias|/referencia> (vea L<perllol> y L<perldsc>).

source: Perl is not an interpreter by this definition, because it contains a kind of compiler that takes a program and turns it into a more executable form (L<syntax trees|/syntax tree>) within the I<perl> process itself, which the Perl L</run time> system then interprets.
es: Según esta definición, Perl no es un intérprete, ya que contiene una especie de compilador que convierte un programa a un formato más fácil de ejecutar (L<árboles de sintaxis|/árbol de sintaxis>) dentro del mismo proceso de I<perl>, para que el sistema de L</tiempo de ejecución> de Perl lo interprete.

source: Perl uses the same mechanism to produce C, C, etc, so you also pay a price for each pattern that contains capturing parentheses.
es: Perl utiliza el mismo mecanismo para producir C, C, etc., por lo que también se paga un precio por cada patrón que contenga paréntesis de captura.

source: Perl 0 introduced Perl to my officemates.
es: Presentación de Perl 0 a mis compañeros de trabajo.

source: Perl 1 introduced Perl to the world, and changed /\(...\|...\)/ to
es: Presentación de Perl 1 al mundo, y cambio de /\(...\|...\)/ a

source: Perl 2 introduced Henry Spencer's regular expression package.
es: En Perl 2 se incluyó el paquete de expresiones regulares de Henry Spencer.

source: Perl 3 introduced the ability to handle binary data (embedded nulls).
es: En Perl 3 se ofreció la capacidad de procesar datos binarios (valores nulos incrustados).

source: Perl 4 introduced the first Camel book.
es: Perl 4 llegó con la publicación de la primera edición del Libro del Camello.

source: Perl 5 introduced everything else, including the ability to
es: En Perl 5 se incluyó todo lo demás, incluida la capacidad

source: Perl 6 development also has a presence in L<irc://irc.freenode.net/#perl6>.
es: El desarrollo de Perl 6 también tiene presencia en L<irc://irc.freenode.net/#perl6>.

source: Perl 6 is not scheduled for release yet, and Perl 5 will still be supported for quite awhile after its release.
es: El lanzamiento de Perl 6 aún no está programado, pero recuerde que Perl 5 seguirá vivo mucho tiempo después de que esto ocurra.

source: Perl 6 is the next major version of Perl, although it's not intended to replace Perl 5.
es: Perl 6 es la siguiente versión principal de Perl, pero no es un sustituto de Perl 5.

source: Perl 6 was an oft used term for Chip Salzenberg's project to rewrite Perl in C++ named Topaz.
es: Perl 6 era un nombre que se solía usar para hacer referencia a un proyecto de Chip Salzenberg, con nombre clave Topaz, consistente en reescribir Perl en C++.

source: Perl I<does> provide special syntax for method invocation, the C<< -> >> operator.
es: Perl I<ofrece> una sintaxis especial para la llamada a métodos: el operador C<< -> >>.

source: Perl I<only> provides method inheritance as a built-in feature.
es: Perl I<sólo> proporciona herencia de métodos como una característica propia.

source: Perl Mongers?
es: ¿Y Perl Mongers?

source: Perl actually stands for Pathologically Eclectic Rubbish Lister, but don't tell anyone I said that.
es: En realidad Perl significa I<Pathologically Eclectic Rubbish Lister> (Presentador de basura patológicamente ecléctico), pero nadie debe enterarse de esto :-).

source: Perl after 5.7.2 has support for the C<CLONE> special subroutine.
es: Desde la versión 5.7.2 de Perl se incluye la subrutina especial C<CLONE>.

source: Perl after 5.8.7 has support for the C<CLONE_SKIP> special subroutine.
es: En la versión 5.8.7 de Perl se incluyó la subrutina especial C<CLONE_SKIP>.
